import numpy as np
# sc : 太陽定数 (日射量の単位と同じ単位で与える)
# nyear, nday : 計算対象年（西暦年）,年間通し日数(1～365,西暦年が閏年なら1～366)
# sh,sA,Aw,beta,albedo : 太陽高度(°),太陽方位角(°),斜面方位角(°),斜面傾斜角（°）地物反射率（0～1）
# Ig,Ib,Id : 水平面全天日射量,法線面直達日射量,水平面天空日射量

nyear = keisann_df["計算対象年"]
nday = keisann_df["年間通し日数"]
sh = keisann_df["太陽高度(度)"]
sA = keisann_df["太陽方位(度)"]
Aw = keisann_df["斜面方位角(度)"]
beta = keisann_df["斜面傾斜角(度)"]
albedo = keisann_df["アルベド"]
Ig = keisann_df["水平面全天日射量"]
Ib = keisann_df["法線面直達日射量"]

# 熱負荷計算や建物の熱環境評価ではdef=1
def tiltrad():
    Id = Ig - Ib * np.sin(sh)
    dr = np.pi / 180
    k0 = 1.041
    sc = 1370
    # ----------- 入射角の余弦incosの計算----------------------------------------------------
    incos = np.cos(dr * beta) * np.sin(dr*sh) + np.sin(dr*beta) * np.cos(dr*sh) * np.cos(dr*(sA-Aw))
    if incos < 0:
        incos = 0

    # ----------非一様分布モデル(Perezモデル）-----------------------------------------------
    # ----------準直達成分,一様成分の係数F1--------------------------------------------------
    F1km = [[-0.008, 0.588, -0.062],
            [0.130, 0.683, -0.151],
            [0.330, 0.487, -0.221],
            [0.568, 0.187, -0.295],
            [0.873, -0.392, -0.362],
            [1.132, -1.237, -0.412],
            [1.062, -1.600, -0.359],
            [0.678, -0.327, -0.250]]
    # ----------地平成分の係数F2-------------------------------------------------------------
    F2km = [[-0.060, 0.072, -0.022],
            [-0.019, 0.066, -0.029],
            [0.055, -0.064, -0.026],
            [0.109, -0.152, -0.014],
            [0.226, -0.462, 0.001],
            [0.288, -0.823, 0.056],
            [0.264, -1.127, 0.131],
            [0.156, -1.377, 0.251]]
    # ----------非一様分布モデルの斜面準直達日射量circum,斜面天空一様日射量backs,-------------
    # ----------地平天空日射量horiz,及び斜面直達日射tiltIb,斜面天空日射tiltIdの計算-----------
    n0 = nyear - 1968
    d0 = 3.71 + 0.2596 * n0 - int((n0 + 3.0) / 4.0)
    m0 = dr * 0.9856 * (nday - d0)
    nyu = m0 + dr * (1.914 * np.sin(m0) + 0.02 * np.sin(2.0 * m0))
    r = 1 + 0.033 * np.cos(nyu)
    extIb = r * sc
    Zd = 90 - sh
    Z = dr * Zd
    a = incos
    b = np.cos(Z)
    if b < 0.087:
        b = 0.087

    ep = ((Id + Ib) / Id + k0 * Z ** 3.0) / (1.0 + k0 * Z ** 3.0)
    am = 1 / (np.sin(dr * sh) + 0.15 * (93.885 - Zd) ** (-1.253))
    de = Id * am / extIb

    if ep < 1.065:
        m = 0
    elif ep >= 1.065 and ep < 1.23:
        m = 1
    elif ep >= 1.23 and ep < 1.5:
        m = 2
    elif ep >= 1.5 and ep < 1.95:
        m = 3
    elif ep >= 1.95 and ep < 2.8:
        m = 4
    elif ep >= 2.8 and ep < 4.5:
        m = 5
    elif ep >= 4.5 and ep < 6.2:
        m = 6
    else: #  ep >= 6.2
        m = 7

    F1k = []
    for k in range(0, 3, 1):
        F1k.append(F1km[m][k])

    F1 = F1k[0] + F1k[1] * de + F1k[2] * Z
    circum = Id * F1 * a / b

    if circum < 0:
        circum = 0
    F2k = []
    backs = Id * (1 - F1) * ((1 + np.cos(dr * beta)) / 2)
    for k in range(0, 3, 1):
        F2k.append(F2km[m][k])
    F2 = F2k[0] + F2k[1] * de + F2k[2] * Z
    horiz = Id * F2 * np.sin(dr * beta)
    if horiz < 0:
        horiz = 0

    # ----------- 一様分布モデルの斜面直達日射tiltIb,斜面天空日射tiltIdの計算----------------
    if def_ == 0:  # 一様分布モデル
        tiltIb = Ib * incos
        tiltId = Id * (1 + np.cos(dr * beta))/2
    elif def_ == 1:  # 天空非一様分布(準直達日射を直達日射とする)
        tiltIb = Ib * incos + circum
        tiltId = backs + horiz
    else :  # 天空非一様分布(準直達日射を天空日射とする)
        tiltIb = Ib * incos
        tiltId = circum + backs + horiz

    # -----------def値による準直達日射circumのtiltIbまたはtiltIdへの組み込み------------------
    # -----------地物による反射日射量の計算（一様分布モデル、非一様分布モデル共通）------------
    tiltRef= Ig * albedo * (1 - np.cos(dr * beta))/2
    tiltIt = tiltIb + tiltId + tiltRef

    return tiltIb, tiltId, tiltRef, tiltIt


    # +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    # 水平面全天日射量,法線面直達日射量,水平面天空日射量から,
    # 任意斜面の直達日射量,天空日射量,地物反射日射量,及び全日射量を計算するプログラム。
    # 天空日射の分布を一様(isotropic)とするか,非一様(anisotropic, Perez et.alによる)とするかをdefにより切り替える。
    # 一様分布モデルを選択する場合は,def=0とする。非一様分布を選択する場合は,準直達日射(circumsolar radiation)を
    # 直達日射に含めるならdef=1,天空日射に含めるならdef=2とする。本プログラムでは,熱負荷計算や建物の熱環境評価では
    # def=1,直達光の制御や太陽光発電のシミュレーションではdef=2を推奨するが,これらの選択はユーザーが決める。
    # 本プログラムを修正すれば,上記以外の組み換えも可能である。
    # -----------合成計算に必要な入力データ（defのみ整数、それ以外は実数）----------------------------------------
    # def_ : def_=0 のとき、天空一様分布
    # def_=1 のとき、天空非一様分布(準直達日射を直達日射とする)
    # def_=2 のとき、天空非一様分布(準直達日射を天空日射とする)

    # ----------プログラムにより得られる計算結果（すべて実数）----------------------------------------------------
    # tiltIb,tiltId,tiltRef,tiltIt : 斜面直達日射量,斜面天空日射量,斜面地物反射日射量,斜面全日射量
    # ---------プログラム内部で定義して使用している主な変数（すべて実数）-----------------------------------------
    # r : 太陽定数から大気外法線面日射量を求める補正係数
    # extIb,Zd, Z, incos : 大気外法線面日射量,天頂角（度), 天頂角(ラジアン）,斜面への日射入射角の余弦
    # circum, horiz, backs : 斜面準直達日射量,斜面地平日射量,斜面一様天空日射量
    # ep,am,de,k1,F1km,F1k,f1,F2km,F2k,F2 : 非一様分布モデルに使用する係数y
    # +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 202005 by H.Akasaka ++++++++++++++++++++++++++